import React  from 'react';
import './info.css';

function Info () {

    return (
        <div className='info'>
            <h1 >Добро пожаловать в Word Mash</h1>
            <p className='open-p'>О сайте</p>
            <p className='text-p'>Сайт Word Mash создан для изучения иностранного 
                языка при помощи набора иностранных слов.</p>
            <p className='open-p'>Возможности на сайте</p>
            <p className='text-p'>Для начала тренировки в верхнем меню зайдите 
                в раздел настройки, в настройках выберите режим работы и сложность, 
                так же вы можете составить свои списки слов для изучения. 
                Далее выберите один из вами составленных 
                списков и в верхнем меню нажмите на "Запустить", при нажатии 
                случайным образом перемешаются слова из вами выбранного списака 
                и вы сможете начать тренировку.</p>
            <p className='open-p'>Режимы работы</p>
            <p className='text-p'>Контекстный режим составляет предложения с 
            использованием вами введенных иностранных слов для изучения их в контексте.</p>
            <p className='text-p'>Словарный режим перемешывает вами введенные слова и 
            составляет из них тесты.</p>
            <p className='open-p'>Сложность</p>
            <p className='text-p'>Легкая сложность не перезапускает тест при неправельно введенной
            букве.</p>
            <p className='text-p'>Сложная сложность перезапускает тест при неправильном вводе.</p>
            <p className='open-p'>Списки слов</p>
            <p className='text-p'>Они нужны для разделения ваших слов на несколько групп.</p>
            <p className='open-p'>Контакты</p>
            <p >почта: endru2005wwr@yandex.ru</p>

        </div>
    );
}

export default Info;
